# Data Analysis Basic Concepts using Pandas

In [38]:
import pandas as pd

In [39]:
dict1={'Name':['Akshay','Rohit','Shivraj','Sakshi','Sagar','Guru','Ram','Komal'],
      'Marks':[95,79,67,94,90,85,94,90],
      'Gender':['Male','Male','Male','Female','Male','Male','Male','Female']
        }
df1= pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0   Akshay     95    Male
1    Rohit     79    Male
2  Shivraj     67    Male
3   Sakshi     94  Female
4    Sagar     90    Male
5     Guru     85    Male
6      Ram     94    Male
7    Komal     90  Female

In [40]:
# Top 3 rows of Dataset
df1.head(3)

      Name  Marks Gender
0   Akshay     95   Male
1    Rohit     79   Male
2  Shivraj     67   Male

In [41]:
# Check last 3 rows of datset
df1.tail(3)

    Name  Marks  Gender
5   Guru     85    Male
6    Ram     94    Male
7  Komal     90  Female

In [42]:
#find out no. of rows and no. of columns ie. shape
df1.shape

(8, 3)

In [43]:
print('Number of rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of rows 8
Number of Columns 3

In [44]:
#Get Information about our Dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Marks   8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [45]:
#Check null values in dataset
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [46]:
#Get overall Statistics about Dataframe
df1.describe(include='all')

         Name      Marks Gender
count       8   8.000000      8
unique      8        NaN      2
top     Komal        NaN   Male
freq        1        NaN      6
mean      NaN  86.750000    NaN
std       NaN   9.617692    NaN
min       NaN  67.000000    NaN
25%       NaN  83.500000    NaN
50%       NaN  90.000000    NaN
75%       NaN  94.000000    NaN
max       NaN  95.000000    NaN

In [47]:
#Find Unique Values
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [48]:
#Find Number of Unique Values
df1["Gender"].nunique()

2

In [49]:
#Count Of Unique Columns
df1["Gender"].value_counts()

Male      6
Female    2
Name: Gender, dtype: int64

In [50]:
#Finding the students whose marks between 90 to 100
df1[df1["Marks"]>=90]

     Name  Marks  Gender
0  Akshay     95    Male
3  Sakshi     94  Female
4   Sagar     90    Male
6     Ram     94    Male
7   Komal     90  Female

In [51]:
#Finding the students whose marks between 90 to 100 by using Between method
df1[df1['Marks'].between(90,100)]

     Name  Marks  Gender
0  Akshay     95    Male
3  Sakshi     94  Female
4   Sagar     90    Male
6     Ram     94    Male
7   Komal     90  Female

In [52]:
#Finding total no. of students whose marks between 90 to 100 by using Between method
sum(df1['Marks'].between(90,100))

5